# AceleraDev Codenation - Semana 2 #

**prof. Túlio Vieira de Souza | Aceleração Data Science**

### Manipulação de dados ###

**Importações iniciais**

In [2]:
import pandas as pd
import numpy as np

Durante as suas execuções, se houver dúvidas sobre bibliotecas e funções, você pode buscar a ajuda do python. O comando abaixo, quando executado, mostra uma tabela de ajuda.

In [3]:
pd?

### Dicionários em Python ###

In [4]:
dados = {'canal_venda' : ['facebook', 'instagram', 'linkedin', 'facebook', 'snap'],
        'acessos' : [100, 200, 300, 400, 500],
        'site' : ['site1', 'site1', 'site2', 'site2', 'site3'],
        'vendas' : [1000.52, 1052.34, 2002, 5000, 300]}

In [5]:
dados

{'canal_venda': ['facebook', 'instagram', 'linkedin', 'facebook', 'snap'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

**Verificação de tipos**

In [6]:
type(dados)

dict

**Acessar chaves**

In [7]:
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

#### Acesso à uma chava específica ####

In [8]:
dados['canal_venda']

['facebook', 'instagram', 'linkedin', 'facebook', 'snap']

**Acesso à uma posição específica**

In [9]:
dados['acessos'][2]

300

Acesso à uma posição específica com uma condição. Neste caso, com a condição de acesso à lista de acessos, buscando os dois primeiros valores da lista.

In [10]:
dados['acessos'][:2]

[100, 200]

### Listas em Python ###

**Criação de listas**

In [11]:
lista = [200, 200, 300, 800, 200]

In [12]:
print(lista)

[200, 200, 300, 800, 200]

**Acesso a valores especificos**

In [13]:
lista[1]

200

**Acesso a valores específicos com uma condicional**

In [14]:
lista[:3]

[200, 200, 300]

#### Adicionar a lista ao dicionário #####

In [15]:
dados['lista'] = lista

In [16]:
dados

{'canal_venda': ['facebook', 'instagram', 'linkedin', 'facebook', 'snap'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

### DataFrames em Python ###

**Criação de um DataFrame**

In [17]:
dados

{'canal_venda': ['facebook', 'instagram', 'linkedin', 'facebook', 'snap'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

In [68]:
data_frame = pd.DataFrame(data=dados)

In [19]:
data_frame

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1   instagram      200  site1  1052.34    200
2    linkedin      300  site2  2002.00    300
3    facebook      400  site2  5000.00    800
4        snap      500  site3   300.00    200

A função **head()** mostra os primeiros valores do DataFrame

In [20]:
data_frame.head()

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1   instagram      200  site1  1052.34    200
2    linkedin      300  site2  2002.00    300
3    facebook      400  site2  5000.00    800
4        snap      500  site3   300.00    200

A função **shape** mostra o formato dos dados

In [21]:
data_frame.shape

(5, 5)

**Índice de um DataFrame**

In [22]:
data_frame.index

RangeIndex(start=0, stop=5, step=1)

**Verificação de tipo de um DataFrame**

In [23]:
data_frame.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

**Verificação dos valores faltantes**

In [24]:
data_frame.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [25]:
data_frame.isna().sum()

canal_venda    0
acessos        0
site           0
vendas         0
lista          0
dtype: int64

**Verificação dos nomes das colunas**

In [26]:
data_frame.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

**Acesso à uma coluna específica**

In [27]:
data_frame['canal_venda']

0     facebook
1    instagram
2     linkedin
3     facebook
4         snap
Name: canal_venda, dtype: object

**Criação de uma nova coluna**

In [28]:
data_frame['usuarios'] = [20,20,50,30,10]

In [29]:
data_frame.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'usuarios'], dtype='object')

In [30]:
data_frame.shape

(5, 6)

In [31]:
data_frame

  canal_venda  acessos   site   vendas  lista  usuarios
0    facebook      100  site1  1000.52    200        20
1   instagram      200  site1  1052.34    200        20
2    linkedin      300  site2  2002.00    300        50
3    facebook      400  site2  5000.00    800        30
4        snap      500  site3   300.00    200        10

**Remoção de colunas**

In [32]:
data_frame.drop(columns = 'lista', inplace = True)

In [33]:
data_frame

  canal_venda  acessos   site   vendas  usuarios
0    facebook      100  site1  1000.52        20
1   instagram      200  site1  1052.34        20
2    linkedin      300  site2  2002.00        50
3    facebook      400  site2  5000.00        30
4        snap      500  site3   300.00        10

**Acesso a valores específicos**

In [34]:
data_frame['canal_venda'][2]

'linkedin'

**Fatiação de um DataFrame**

In [35]:
data_frame.iloc[:2, 4:]

   usuarios
0        20
1        20

In [36]:
data_frame.loc[:3]

  canal_venda  acessos   site   vendas  usuarios
0    facebook      100  site1  1000.52        20
1   instagram      200  site1  1052.34        20
2    linkedin      300  site2  2002.00        50
3    facebook      400  site2  5000.00        30

**Selecionar colunas específicas**

In [37]:
data_frame[['canal_venda', 'acessos']]

  canal_venda  acessos
0    facebook      100
1   instagram      200
2    linkedin      300
3    facebook      400
4        snap      500

**Passando os valores atraves de lista**

In [38]:
filtro = ['canal_venda', 'acessos']

In [39]:
data_frame[filtro]

  canal_venda  acessos
0    facebook      100
1   instagram      200
2    linkedin      300
3    facebook      400
4        snap      500

**Acesso às informações do DataFrame**

In [40]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         5 non-null      object
 3   vendas       5 non-null      float64
 4   usuarios     5 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 328.0+ bytes

**Pivotizando os dados(colunas)**

In [41]:
data_frame.pivot(index = 'canal_venda', columns = 'site', values = 'acessos')

site         site1  site2  site3
canal_venda
facebook     100.0  400.0    NaN
instagram    200.0    NaN    NaN
linkedin       NaN  300.0    NaN
snap           NaN    NaN  500.0

**Completando valores nulos com 0, usando a função *fillna*.**

In [42]:
aux = data_frame.pivot(index = 'canal_venda', columns = 'site', values = 'acessos').fillna(0)
data_frame.pivot(index = 'canal_venda', columns = 'site', values = 'acessos').fillna(0)

site         site1  site2  site3
canal_venda
facebook     100.0  400.0    0.0
instagram    200.0    0.0    0.0
linkedin       0.0  300.0    0.0
snap           0.0    0.0  500.0

**Mudando as colunas usando o comando melt**

In [43]:
data_frame.melt(id_vars = 'site', value_vars = ['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebook
1  site1  canal_venda  instagram
2  site2  canal_venda   linkedin
3  site2  canal_venda   facebook
4  site3  canal_venda       snap

**Resetando o índice do DataFrame**

In [44]:
print(aux.columns)
aux = aux.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['canal_venda', 'site1', 'site2', 'site3'], dtype='object', name='site')

**Exemplo do comando melt**

In [45]:
aux.melt(id_vars = 'canal_venda', value_vars = ['site1', 'site2', 'site3'])

   canal_venda   site  value
0     facebook  site1  100.0
1    instagram  site1  200.0
2     linkedin  site1    0.0
3         snap  site1    0.0
4     facebook  site2  400.0
5    instagram  site2    0.0
6     linkedin  site2  300.0
7         snap  site2    0.0
8     facebook  site3    0.0
9    instagram  site3    0.0
10    linkedin  site3    0.0
11        snap  site3  500.0

In [46]:
data_frame.sum()

canal_venda    facebookinstagramlinkedinfacebooksnap
acessos                                         1500
site                       site1site1site2site2site3
vendas                                       9354.86
usuarios                                         130
dtype: object

In [47]:
data_frame.sum(axis = 1)

0    1120.52
1    1272.34
2    2352.00
3    5430.00
4     810.00
dtype: float64

**Calculando a mediana das colunas númericas**

In [48]:
print('Por linhas: ', data_frame.median(axis = 1))
print('Por colunas: ', data_frame.median())

Por linhas:  0    100.0
1    200.0
2    300.0
3    400.0
4    300.0
dtype: float64
Por colunas:  acessos      300.00
vendas      1052.34
usuarios      20.00
dtype: float64

**Calculando a media das colunas númericas**

In [49]:
data_frame.mean()

acessos      300.000
vendas      1870.972
usuarios      26.000
dtype: float64

**Calculando o desvio padrão das colunas númericas**

In [50]:
data_frame.std()

acessos      158.113883
vendas      1850.931024
usuarios      15.165751
dtype: float64

**Descrição do DataFrame**

In [51]:
data_frame.describe()

          acessos       vendas   usuarios
count    5.000000     5.000000   5.000000
mean   300.000000  1870.972000  26.000000
std    158.113883  1850.931024  15.165751
min    100.000000   300.000000  10.000000
25%    200.000000  1000.520000  20.000000
50%    300.000000  1052.340000  20.000000
75%    400.000000  2002.000000  30.000000
max    500.000000  5000.000000  50.000000

**Valor máximo por coluna**

In [52]:
data_frame.max()

canal_venda     snap
acessos          500
site           site3
vendas          5000
usuarios          50
dtype: object

**Calculando a moda do DataFrame**

In [53]:
data_frame.mode()

  canal_venda  acessos   site   vendas  usuarios
0    facebook      100  site1   300.00      20.0
1         NaN      200  site2  1000.52       NaN
2         NaN      300    NaN  1052.34       NaN
3         NaN      400    NaN  2002.00       NaN
4         NaN      500    NaN  5000.00       NaN

**Valor mínimo por coluna**

In [54]:
data_frame.min()

canal_venda    facebook
acessos             100
site              site1
vendas              300
usuarios             10
dtype: object

**Valores únicos**

In [55]:
data_frame.nunique()

canal_venda    4
acessos        5
site           3
vendas         5
usuarios       4
dtype: int64

**Valores únicos em uma coluna**

In [56]:
data_frame['canal_venda'].value_counts()

facebook     2
linkedin     1
instagram    1
snap         1
Name: canal_venda, dtype: int64

**Usando groupy by com valores numéricos**

In [57]:
data_frame.groupby('site')['acessos'].sum()

site
site1    300
site2    700
site3    500
Name: acessos, dtype: int64

In [58]:
data_frame.groupby('site')['acessos'].mean()

site
site1    150
site2    350
site3    500
Name: acessos, dtype: int64

**Usando o groupby com a função agg**

In [59]:
data_frame.groupby('canal_venda').agg({'site': 'unique',
                                      'acessos' : 'sum'})

                       site  acessos
canal_venda
facebook     [site1, site2]      500
instagram           [site1]      200
linkedin            [site2]      300
snap                [site3]      500

**Correlação dos dados**

In [60]:
data_frame.corr()

           acessos    vendas  usuarios
acessos   1.000000  0.217542 -0.104257
vendas    0.217542  1.000000  0.453593
usuarios -0.104257  0.453593  1.000000

**Criação de variáveis categóricas por fatia de variável númerica**

In [61]:
data_frame['categoria_acessos'] = pd.cut(data_frame['vendas'],
                                        bins = (0, 1500, 2000, 8000),
                                        labels = ('0 a 1500', '1500 a 2000', '2000 a 8000'))

**Criando uma variável categórica usando compressão de lista**

In [62]:
data_frame = ['maior_que_100' if x > 300 else 'menor_que_100' for x in data_frame['acessos']]

**Juntando dois DataFrames**

In [63]:
dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
               'suporte': ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']},
                          index=[0, 1, 2, 3, 4])

**Realizando um merge**

In [64]:
 df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']},
                     index=[0, 1, 2, 3])
    
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                      index=[4, 5, 6, 7])

In [65]:
frames = [df1, df2]
result = pd.concat(frames)

In [66]:
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

**Salvar DataFrame como csv**

In [69]:
data_frame.to_csv('data_frame.csv', sep = ';', decimal = ',', index = False)

**Lendo um DataFrame como csv**

In [ ]:
dataframe_lido = pd.read_csv('data_frame.csv', sep = ';', decimal = ',')

In [ ]:
dataframe_lido.head()

### Imputação de dados ###

In [71]:
df = pd.read_csv('train.csv')

In [73]:
aux = pd.DataFrame({'columns' : df.columns,
                    'tipos' : df.dtypes,
                     'percentual_faltantes' : df.isna().sum() / df.shape[0]})

In [74]:
aux

                 columns    tipos  percentual_faltantes
PassengerId  PassengerId    int64              0.000000
Survived        Survived    int64              0.000000
Pclass            Pclass    int64              0.000000
Name                Name   object              0.000000
Sex                  Sex   object              0.000000
Age                  Age  float64              0.198653
SibSp              SibSp    int64              0.000000
Parch              Parch    int64              0.000000
Ticket            Ticket   object              0.000000
Fare                Fare  float64              0.000000
Cabin              Cabin   object              0.771044
Embarked        Embarked   object              0.002245

**Dados númericos : média ou mediana**

In [75]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

**Dados categóricos: Unknow ou moda**

In [76]:
df['Cabin'] = df['Cabin'].fillna('Unknow')

In [77]:
df['Cabin'].value_counts()

Unknow         687
G6               4
B96 B98          4
C23 C25 C27      4
E101             3
              ...
B42              1
D7               1
C86              1
F38              1
E49              1
Name: Cabin, Length: 148, dtype: int64